package LinearStructure.Queue.Storage.Linked;

/**
 * @author Email 3394427855@qq.com
 * @version 2022/10/24 19:34
 * @uesr 刘梹晨
 */
public class MyQueueTest {
    //指向队列头元素的引用
    //指向队列尾元素的引用
    //初始化

    /**
     * 判断队列是否为空
     *
     * @return 如果队列为空返回true，否则返回false
     */

    //指向队头元素的引用为空，即队列为空

    /**
     * 入队
     *
     * @param item 要在队尾插入的元素
     */

    //创建一个要插入的新结点
    //考虑队列为空的情况
    //将队头和队尾都指向新添加的结点
    //队列有元素的情况下

    //要删除的就是头结点所在的元素
    //如果队列只有一个元素
    //删除后队列置为空
    //将队列头元素结点指向元队列头的下一个结点
    //返回要删除结点的数据
}
